# Клітини на шахівниці ідентифікуються буквою і цифрою. Літера визначає положення клітини по горизонталі,
# а цифра – по вертикалі. Ваша програма повинна вимагати у користувача координати клітини. Використовуйте умовний
# вираз для визначення того, з якої клітини – білої чи чорної – починається стовпець. Потім, за допомогою звичайної
# арифметики, необхідно визначити колір конкретної клітини. Наприклад, якщо користувач ввів a1, програма має
# визначити, що клітина із цими координатами чорна. Якщо d5 – біла. Перевірку на хибність введення координат клітини
# виконувати не потрібно.
letter = input('Enter the letter of coordinate: ').lower()
number = int(input('Enter the number of coordinate: '))

letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
numbers = range(1, 9)


letter_index = letters.index(letter)
number_index = numbers.index(number)
if letter_index % 2 == number_index % 2:
    print('Black')
else:
    print('White')

